### WHY RFM ?

To build an effective Customer Relationship Management (CRM) strategy, companies need to understand how each customer interacts with their business. This requires answering three key questions:

> **Recency – When was the customer’s most recent purchase?**

> **Frequency – How often does the customer make purchases?**

> **Monetary – How much has the customer spent?**

By analyzing these factors, customers can be grouped into meaningful segments, reducing thousands of individual profiles into a more manageable set of categories. This process is known as RFM analysis, where RFM stands for Recency, Frequency, and Monetary. To segment customers effectively, businesses first calculate these RFM metrics and then assign each customer an RFM score.

In [13]:
import numpy as np
import pandas as pd
import datetime as dt

pd.set_option('display.max_columns', None)
pd.set_option('display.float_format', lambda x: '%.5f' % x)

import warnings
warnings.filterwarnings("ignore")
warnings.simplefilter(action='ignore', category=FutureWarning)

In [14]:
import pandas as pd

# Read with correct encoding
df_2009_2010 = pd.read_excel("online_retail_II.xlsx", 
                    sheet_name="Year 2009-2010") 

df_2010_2011 = pd.read_excel("online_retail_II.xlsx", 
                    sheet_name="Year 2010-2011") 

# Add a column to distinguish datasets
df_2009_2010["Year"] = "2009-2010"
df_2010_2011["Year"] = "2010-2011"

# Merge them
df_all = pd.concat([df_2009_2010, df_2010_2011], ignore_index=True)

In [19]:
df = df_all.copy()
# Quick check
print(df.shape)   # number of rows/cols
df.head()

(1067371, 9)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Year
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95000,13085.00000,United Kingdom,2009-2010
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75000,13085.00000,United Kingdom,2009-2010
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75000,13085.00000,United Kingdom,2009-2010
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10000,13085.00000,United Kingdom,2009-2010
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25000,13085.00000,United Kingdom,2009-2010

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 9 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  datetime64[ns]
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
 8   Year         1067371 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 73.3+ MB

## Understanding the Dataset Variables

- **InvoiceNo**: A unique identifier for each transaction. Invoices that represent refunds include the letter "C".  
- **StockCode**: A distinct code assigned to each product.  
- **Description**: The name or label of the product.  
- **Quantity**: The number of units of a product in a single transaction.  
- **InvoiceDate**: The exact date and time when the transaction occurred.  
- **UnitPrice**: The price of one unit of the product, recorded in Sterling (£).  
- **CustomerID**: A unique identifier assigned to each customer.  
- **Country**: The country of residence of the customer.

### Performing EDA

In [20]:
# Find all duplicate rows
duplicates = df[df.duplicated()]

print(f"Number of duplicate rows: {duplicates.shape[0]}")
duplicates.head()

Number of duplicate rows: 12133

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Year
371,489517,21912,VINTAGE SNAKES & LADDERS,1,2009-12-01 11:34:00,3.75000,16329.00000,United Kingdom,2009-2010
383,489517,22130,PARTY CONE CHRISTMAS DECORATION,6,2009-12-01 11:34:00,0.85000,16329.00000,United Kingdom,2009-2010
384,489517,22319,HAIRCLIPS FORTIES FABRIC ASSORTED,12,2009-12-01 11:34:00,0.65000,16329.00000,United Kingdom,2009-2010
385,489517,21913,VINTAGE SEASIDE JIGSAW PUZZLES,1,2009-12-01 11:34:00,3.75000,16329.00000,United Kingdom,2009-2010
386,489517,21821,GLITTER STAR GARLAND WITH BELLS,1,2009-12-01 11:34:00,3.75000,16329.00000,United Kingdom,2009-2010

In [21]:
# Remove duplicates

print("Before:", df.shape)
df = df.drop_duplicates()
print("After:", df.shape)

Before: (1067371, 9)
After: (1055238, 9)

In [22]:
df['Country'].nunique()

43

In [23]:
df['Country'].value_counts()

Country
United Kingdom          969347
EIRE                     17844
Germany                  17600
France                   14296
Netherlands               5139
Spain                     3799
Switzerland               3181
Belgium                   3122
Portugal                  2608
Australia                 1912
Channel Islands           1663
Italy                     1532
Norway                    1455
Sweden                    1362
Cyprus                    1157
Finland                   1049
Austria                    938
Denmark                    817
Unspecified                752
Greece                     663
Japan                      582
Poland                     535
USA                        535
United Arab Emirates       500
Israel                     368
Hong Kong                  360
Singapore                  346
Malta                      299
Iceland                    253
Canada                     228
Lithuania                  189
RSA                        169
Bahrain                    126
Brazil                      94
Thailand                    76
Korea                       63
European Community          61
Lebanon                     58
West Indies                 54
Bermuda                     34
Nigeria                     32
Czech Republic              30
Saudi Arabia                10
Name: count, dtype: int64